{
    "eng": {
        "privacy_title": "Privacy Notice",
        "privacy_subtitle": "This website is an anonymous problem-sharing and venting platform. No user accounts or registrations are required.",
        "privacy_item1_heading":"1. Anonymity",
        "privacy_item1_point1": "The developer does not collect names, email addresses, phone numbers, login credentials, or social media links.",
        "privacy_item1_point2": "Users remain anonymous at all times.",
        "privacy_item1_point3": "Inputs that resemble phone numbers, email addresses, or links are automatically blocked.",
        "privacy_item2_heading": "2. Information You May Provide",
        "privacy_item2_subheading1": "When submitting a story, you may voluntarily provide limited, non-identifying information for display and statistical purposes:",
        "privacy_item2_point1": "Gender (required)",
        "privacy_item2_point2": "Age range (optional)",
        "privacy_item2_point3": "Location (state) (optional)",
        "privacy_item2_point4": "Occupation category (optional)",
        "privacy_item2_subheading2": "This information is used only to:",
        "privacy_item2_point5": "Display vague author context on posts",
        "privacy_item2_point6": "Generate public demographic statistics and charts",
        "privacy_item2_subheading3": "No attempt is made to identify individuals.",
        "privacy_item3_heading": "3. Automatically Stored Data",
        "privacy_item3_point1": "Post views: The app stores post IDs in your browser’s local storage to ensure one view per user per post.",
        "privacy_item3_point2": "Managing your posts: The developer also uses your browser's storage to remember which posts you authored. This allows you to delete your posts later without needing an account. Note: If you clear your browser data or switch devices, you will lose the ability to manage or delete those posts.",
        "privacy_item3_point3": "Theme preference: Light/dark mode preference is stored in local storage for usability.",
        "privacy_item3_subheading": "Local storage data stays on your device and is not linked to your identity.",
        "privacy_item4_heading": "4. Timestamps & Displayed Metrics",
        "privacy_item4_point1": "Each post shows the local date and time when it was submitted to the server.",
        "privacy_item4_point2": "A view count is displayed, representing the number of unique clients that have fetched the post (technically measured).",
        "privacy_item5_heading": "5. Backend & Data Storage",
        "privacy_item5_point1": "Data is stored in Google Firebase Firestore.",
        "privacy_item5_point2": "Stored fields include story text, selected demographics, timestamps, view counts, and internal identifiers.",
        "privacy_item5_point3": "Firestore document IDs are system-generated and do not identify users.",
        "privacy_item6_heading": "6. Data Sharing",
        "privacy_item6_point1": "No personal data is sold, rented, or shared with third parties.",
        "privacy_item6_point2": "Data is only used to operate and display the service.",
        "privacy_item7_heading": "7. Cookies",
        "privacy_item7_point1": "This site does not use cookies.",
        "privacy_item7_point2": "Browser local storage is used solely for view tracking, posts ownership and theme preference.",
        "privacy_item8_heading": "8. Changes",
        "privacy_item8_subheading": "This privacy notice may be updated occasionally to reflect app changes. Continued use of the site indicates acceptance of the latest version."
    },
    "bm": {
    "privacy_title": "Notis Privasi",
    "privacy_subtitle": "Laman web ini ialah platform tanpa nama untuk berkongsi masalah dan meluahkan perasaan. Tiada akaun atau pendaftaran pengguna diperlukan.",

    "privacy_item1_heading": "1. Tanpa Nama",
    "privacy_item1_point1": "Pembangun tidak mengumpul nama, alamat e-mel, nombor telefon, kelayakan log masuk atau pautan media sosial.",
    "privacy_item1_point2": "Pengguna kekal tanpa nama pada setiap masa.",
    "privacy_item1_point3": "Input yang menyerupai nombor telefon, alamat e-mel atau pautan akan disekat secara automatik.",

    "privacy_item2_heading": "2. Maklumat Yang Mungkin Anda Berikan",
    "privacy_item2_subheading1": "Semasa menghantar cerita, anda boleh secara sukarela memberikan maklumat terhad dan tidak mengenal pasti untuk tujuan paparan dan statistik:",
    "privacy_item2_point1": "Jantina (wajib)",
    "privacy_item2_point2": "Julat umur (pilihan)",
    "privacy_item2_point3": "Lokasi (negeri) (pilihan)",
    "privacy_item2_point4": "Kategori pekerjaan (pilihan)",
    "privacy_item2_subheading2": "Maklumat ini digunakan hanya untuk:",
    "privacy_item2_point5": "Memaparkan konteks umum penulis pada kiriman",
    "privacy_item2_point6": "Menjana statistik dan carta demografi awam",
    "privacy_item2_subheading3": "Tiada usaha dibuat untuk mengenal pasti individu.",

    "privacy_item3_heading": "3. Data Yang Disimpan Secara Automatik",
    "privacy_item3_point1": "Paparan kiriman: Aplikasi menyimpan ID kiriman dalam storan setempat pelayar anda untuk memastikan satu paparan bagi setiap pengguna untuk setiap kiriman.",
    "privacy_item3_point2": "Pengurusan kiriman anda: Pembangun juga menggunakan storan pelayar anda untuk mengingati kiriman yang anda hasilkan. Ini membolehkan anda memadam kiriman tersebut kemudian tanpa memerlukan akaun. Nota: Jika anda mengosongkan data pelayar atau menukar peranti, anda akan kehilangan keupayaan untuk mengurus atau memadam kiriman tersebut.",
    "privacy_item3_point3": "Keutamaan tema: Keutamaan mod cerah/gelap disimpan dalam storan setempat untuk tujuan kebolehgunaan.",
    "privacy_item3_subheading": "Data storan setempat kekal pada peranti anda dan tidak dipautkan kepada identiti anda.",

    "privacy_item4_heading": "4. Cap Masa & Metrik Dipaparkan",
    "privacy_item4_point1": "Setiap kiriman memaparkan tarikh dan masa tempatan apabila ia dihantar ke pelayan.",
    "privacy_item4_point2": "Bilangan paparan dipaparkan, mewakili jumlah klien unik yang telah memuatkan kiriman tersebut (diukur secara teknikal).",

    "privacy_item5_heading": "5. Backend & Penyimpanan Data",
    "privacy_item5_point1": "Data disimpan dalam Google Firebase Firestore.",
    "privacy_item5_point2": "Medan yang disimpan termasuk teks cerita, demografi yang dipilih, cap masa, bilangan paparan dan pengecam dalaman.",
    "privacy_item5_point3": "ID dokumen Firestore dijana oleh sistem dan tidak mengenal pasti pengguna.",

    "privacy_item6_heading": "6. Perkongsian Data",
    "privacy_item6_point1": "Tiada data peribadi dijual, disewa atau dikongsi dengan pihak ketiga.",
    "privacy_item6_point2": "Data hanya digunakan untuk mengendalikan dan memaparkan perkhidmatan.",

    "privacy_item7_heading": "7. Kuki",
    "privacy_item7_point1": "Laman ini tidak menggunakan kuki.",
    "privacy_item7_point2": "Storan setempat pelayar digunakan semata-mata untuk penjejakan paparan, pemilikan kiriman dan keutamaan tema.",

    "privacy_item8_heading": "8. Perubahan",
    "privacy_item8_subheading": "Notis privasi ini boleh dikemas kini dari semasa ke semasa bagi mencerminkan perubahan aplikasi. Penggunaan berterusan laman ini menandakan penerimaan terhadap versi terkini."
  }
}